grevaillot/svd_tools/headers/ATSAM3X8H/can1.h
#pragma once 

/* --- CAN1: Controller Area Network 1 ------------------------------ */

/** @defgroup can1_registers Controller Area Network 1 Register
@{*/

/** CAN1_MR Mode Register **/
#define CAN1_MR			MMIO32(CAN1_BASE + 0x00)
/** CAN1_IER Interrupt Enable Register **/
#define CAN1_IER			MMIO32(CAN1_BASE + 0x04)
/** CAN1_IDR Interrupt Disable Register **/
#define CAN1_IDR			MMIO32(CAN1_BASE + 0x08)
/** CAN1_IMR Interrupt Mask Register **/
#define CAN1_IMR			MMIO32(CAN1_BASE + 0x0c)
/** CAN1_SR Status Register **/
#define CAN1_SR			MMIO32(CAN1_BASE + 0x10)
/** CAN1_BR Baudrate Register **/
#define CAN1_BR			MMIO32(CAN1_BASE + 0x14)
/** CAN1_TIM Timer Register **/
#define CAN1_TIM			MMIO32(CAN1_BASE + 0x18)
/** CAN1_TIMESTP Timestamp Register **/
#define CAN1_TIMESTP			MMIO32(CAN1_BASE + 0x1c)
/** CAN1_ECR Error Counter Register **/
#define CAN1_ECR			MMIO32(CAN1_BASE + 0x20)
/** CAN1_TCR Transfer Command Register **/
#define CAN1_TCR			MMIO32(CAN1_BASE + 0x24)
/** CAN1_ACR Abort Command Register **/
#define CAN1_ACR			MMIO32(CAN1_BASE + 0x28)
/** CAN1_WPMR Write Protect Mode Register **/
#define CAN1_WPMR			MMIO32(CAN1_BASE + 0xe4)
/** CAN1_WPSR Write Protect Status Register **/
#define CAN1_WPSR			MMIO32(CAN1_BASE + 0xe8)
/** CAN1_MMR0 Mailbox Mode Register (MB = 0) **/
#define CAN1_MMR0			MMIO32(CAN1_BASE + 0x200)
/** CAN1_MAM0 Mailbox Acceptance Mask Register (MB = 0) **/
#define CAN1_MAM0			MMIO32(CAN1_BASE + 0x204)
/** CAN1_MID0 Mailbox ID Register (MB = 0) **/
#define CAN1_MID0			MMIO32(CAN1_BASE + 0x208)
/** CAN1_MFID0 Mailbox Family ID Register (MB = 0) **/
#define CAN1_MFID0			MMIO32(CAN1_BASE + 0x20c)
/** CAN1_MSR0 Mailbox Status Register (MB = 0) **/
#define CAN1_MSR0			MMIO32(CAN1_BASE + 0x210)
/** CAN1_MDL0 Mailbox Data Low Register (MB = 0) **/
#define CAN1_MDL0			MMIO32(CAN1_BASE + 0x214)
/** CAN1_MDH0 Mailbox Data High Register (MB = 0) **/
#define CAN1_MDH0			MMIO32(CAN1_BASE + 0x218)
/** CAN1_MCR0 Mailbox Control Register (MB = 0) **/
#define CAN1_MCR0			MMIO32(CAN1_BASE + 0x21c)
/** CAN1_MMR1 Mailbox Mode Register (MB = 1) **/
#define CAN1_MMR1			MMIO32(CAN1_BASE + 0x220)
/** CAN1_MAM1 Mailbox Acceptance Mask Register (MB = 1) **/
#define CAN1_MAM1			MMIO32(CAN1_BASE + 0x224)
/** CAN1_MID1 Mailbox ID Register (MB = 1) **/
#define CAN1_MID1			MMIO32(CAN1_BASE + 0x228)
/** CAN1_MFID1 Mailbox Family ID Register (MB = 1) **/
#define CAN1_MFID1			MMIO32(CAN1_BASE + 0x22c)
/** CAN1_MSR1 Mailbox Status Register (MB = 1) **/
#define CAN1_MSR1			MMIO32(CAN1_BASE + 0x230)
/** CAN1_MDL1 Mailbox Data Low Register (MB = 1) **/
#define CAN1_MDL1			MMIO32(CAN1_BASE + 0x234)
/** CAN1_MDH1 Mailbox Data High Register (MB = 1) **/
#define CAN1_MDH1			MMIO32(CAN1_BASE + 0x238)
/** CAN1_MCR1 Mailbox Control Register (MB = 1) **/
#define CAN1_MCR1			MMIO32(CAN1_BASE + 0x23c)
/** CAN1_MMR2 Mailbox Mode Register (MB = 2) **/
#define CAN1_MMR2			MMIO32(CAN1_BASE + 0x240)
/** CAN1_MAM2 Mailbox Acceptance Mask Register (MB = 2) **/
#define CAN1_MAM2			MMIO32(CAN1_BASE + 0x244)
/** CAN1_MID2 Mailbox ID Register (MB = 2) **/
#define CAN1_MID2			MMIO32(CAN1_BASE + 0x248)
/** CAN1_MFID2 Mailbox Family ID Register (MB = 2) **/
#define CAN1_MFID2			MMIO32(CAN1_BASE + 0x24c)
/** CAN1_MSR2 Mailbox Status Register (MB = 2) **/
#define CAN1_MSR2			MMIO32(CAN1_BASE + 0x250)
/** CAN1_MDL2 Mailbox Data Low Register (MB = 2) **/
#define CAN1_MDL2			MMIO32(CAN1_BASE + 0x254)
/** CAN1_MDH2 Mailbox Data High Register (MB = 2) **/
#define CAN1_MDH2			MMIO32(CAN1_BASE + 0x258)
/** CAN1_MCR2 Mailbox Control Register (MB = 2) **/
#define CAN1_MCR2			MMIO32(CAN1_BASE + 0x25c)
/** CAN1_MMR3 Mailbox Mode Register (MB = 3) **/
#define CAN1_MMR3			MMIO32(CAN1_BASE + 0x260)
/** CAN1_MAM3 Mailbox Acceptance Mask Register (MB = 3) **/
#define CAN1_MAM3			MMIO32(CAN1_BASE + 0x264)
/** CAN1_MID3 Mailbox ID Register (MB = 3) **/
#define CAN1_MID3			MMIO32(CAN1_BASE + 0x268)
/** CAN1_MFID3 Mailbox Family ID Register (MB = 3) **/
#define CAN1_MFID3			MMIO32(CAN1_BASE + 0x26c)
/** CAN1_MSR3 Mailbox Status Register (MB = 3) **/
#define CAN1_MSR3			MMIO32(CAN1_BASE + 0x270)
/** CAN1_MDL3 Mailbox Data Low Register (MB = 3) **/
#define CAN1_MDL3			MMIO32(CAN1_BASE + 0x274)
/** CAN1_MDH3 Mailbox Data High Register (MB = 3) **/
#define CAN1_MDH3			MMIO32(CAN1_BASE + 0x278)
/** CAN1_MCR3 Mailbox Control Register (MB = 3) **/
#define CAN1_MCR3			MMIO32(CAN1_BASE + 0x27c)
/** CAN1_MMR4 Mailbox Mode Register (MB = 4) **/
#define CAN1_MMR4			MMIO32(CAN1_BASE + 0x280)
/** CAN1_MAM4 Mailbox Acceptance Mask Register (MB = 4) **/
#define CAN1_MAM4			MMIO32(CAN1_BASE + 0x284)
/** CAN1_MID4 Mailbox ID Register (MB = 4) **/
#define CAN1_MID4			MMIO32(CAN1_BASE + 0x288)
/** CAN1_MFID4 Mailbox Family ID Register (MB = 4) **/
#define CAN1_MFID4			MMIO32(CAN1_BASE + 0x28c)
/** CAN1_MSR4 Mailbox Status Register (MB = 4) **/
#define CAN1_MSR4			MMIO32(CAN1_BASE + 0x290)
/** CAN1_MDL4 Mailbox Data Low Register (MB = 4) **/
#define CAN1_MDL4			MMIO32(CAN1_BASE + 0x294)
/** CAN1_MDH4 Mailbox Data High Register (MB = 4) **/
#define CAN1_MDH4			MMIO32(CAN1_BASE + 0x298)
/** CAN1_MCR4 Mailbox Control Register (MB = 4) **/
#define CAN1_MCR4			MMIO32(CAN1_BASE + 0x29c)
/** CAN1_MMR5 Mailbox Mode Register (MB = 5) **/
#define CAN1_MMR5			MMIO32(CAN1_BASE + 0x2a0)
/** CAN1_MAM5 Mailbox Acceptance Mask Register (MB = 5) **/
#define CAN1_MAM5			MMIO32(CAN1_BASE + 0x2a4)
/** CAN1_MID5 Mailbox ID Register (MB = 5) **/
#define CAN1_MID5			MMIO32(CAN1_BASE + 0x2a8)
/** CAN1_MFID5 Mailbox Family ID Register (MB = 5) **/
#define CAN1_MFID5			MMIO32(CAN1_BASE + 0x2ac)
/** CAN1_MSR5 Mailbox Status Register (MB = 5) **/
#define CAN1_MSR5			MMIO32(CAN1_BASE + 0x2b0)
/** CAN1_MDL5 Mailbox Data Low Register (MB = 5) **/
#define CAN1_MDL5			MMIO32(CAN1_BASE + 0x2b4)
/** CAN1_MDH5 Mailbox Data High Register (MB = 5) **/
#define CAN1_MDH5			MMIO32(CAN1_BASE + 0x2b8)
/** CAN1_MCR5 Mailbox Control Register (MB = 5) **/
#define CAN1_MCR5			MMIO32(CAN1_BASE + 0x2bc)
/** CAN1_MMR6 Mailbox Mode Register (MB = 6) **/
#define CAN1_MMR6			MMIO32(CAN1_BASE + 0x2c0)
/** CAN1_MAM6 Mailbox Acceptance Mask Register (MB = 6) **/
#define CAN1_MAM6			MMIO32(CAN1_BASE + 0x2c4)
/** CAN1_MID6 Mailbox ID Register (MB = 6) **/
#define CAN1_MID6			MMIO32(CAN1_BASE + 0x2c8)
/** CAN1_MFID6 Mailbox Family ID Register (MB = 6) **/
#define CAN1_MFID6			MMIO32(CAN1_BASE + 0x2cc)
/** CAN1_MSR6 Mailbox Status Register (MB = 6) **/
#define CAN1_MSR6			MMIO32(CAN1_BASE + 0x2d0)
/** CAN1_MDL6 Mailbox Data Low Register (MB = 6) **/
#define CAN1_MDL6			MMIO32(CAN1_BASE + 0x2d4)
/** CAN1_MDH6 Mailbox Data High Register (MB = 6) **/
#define CAN1_MDH6			MMIO32(CAN1_BASE + 0x2d8)
/** CAN1_MCR6 Mailbox Control Register (MB = 6) **/
#define CAN1_MCR6			MMIO32(CAN1_BASE + 0x2dc)
/** CAN1_MMR7 Mailbox Mode Register (MB = 7) **/
#define CAN1_MMR7			MMIO32(CAN1_BASE + 0x2e0)
/** CAN1_MAM7 Mailbox Acceptance Mask Register (MB = 7) **/
#define CAN1_MAM7			MMIO32(CAN1_BASE + 0x2e4)
/** CAN1_MID7 Mailbox ID Register (MB = 7) **/
#define CAN1_MID7			MMIO32(CAN1_BASE + 0x2e8)
/** CAN1_MFID7 Mailbox Family ID Register (MB = 7) **/
#define CAN1_MFID7			MMIO32(CAN1_BASE + 0x2ec)
/** CAN1_MSR7 Mailbox Status Register (MB = 7) **/
#define CAN1_MSR7			MMIO32(CAN1_BASE + 0x2f0)
/** CAN1_MDL7 Mailbox Data Low Register (MB = 7) **/
#define CAN1_MDL7			MMIO32(CAN1_BASE + 0x2f4)
/** CAN1_MDH7 Mailbox Data High Register (MB = 7) **/
#define CAN1_MDH7			MMIO32(CAN1_BASE + 0x2f8)
/** CAN1_MCR7 Mailbox Control Register (MB = 7) **/
#define CAN1_MCR7			MMIO32(CAN1_BASE + 0x2fc)

/**@}*/


/** @defgroup can1_mr MR Mode Register
@{*/


#define CAN1_MR_RXSYNC_SHIFT		24
#define CAN1_MR_RXSYNC_MASK		0x07
/** @defgroup can1_mr_rxsync RXSYNC Reception Synchronization Stage (not readable)
@{*/
/**@}*/

