grevaillot/svd_tools/headers/ATSAM3X8H/can1.h
/** CAN1_MR_DRPT Disable Repeat **/
#define CAN1_MR_DRPT		(1 << 7)
/** CAN1_MR_TIMFRZ Enable Timer Freeze **/
#define CAN1_MR_TIMFRZ		(1 << 6)
/** CAN1_MR_TTM Disable/Enable Time Triggered Mode **/
#define CAN1_MR_TTM		(1 << 5)
/** CAN1_MR_TEOF Timestamp messages at each end of Frame **/
#define CAN1_MR_TEOF		(1 << 4)
/** CAN1_MR_OVL Disable/Enable Overload Frame **/
#define CAN1_MR_OVL		(1 << 3)
/** CAN1_MR_ABM Disable/Enable Autobaud/Listen mode **/
#define CAN1_MR_ABM		(1 << 2)
/** CAN1_MR_LPM Disable/Enable Low Power Mode **/
#define CAN1_MR_LPM		(1 << 1)
/** CAN1_MR_CANEN CAN Controller Enable **/
#define CAN1_MR_CANEN		(1 << 0)

/**@}*/

/** @defgroup can1_ier IER Interrupt Enable Register
@{*/

/** CAN1_IER_BERR Bit Error Interrupt Enable **/
#define CAN1_IER_BERR		(1 << 28)
/** CAN1_IER_FERR Form Error Interrupt Enable **/
#define CAN1_IER_FERR		(1 << 27)
/** CAN1_IER_AERR Acknowledgment Error Interrupt Enable **/
#define CAN1_IER_AERR		(1 << 26)
/** CAN1_IER_SERR Stuffing Error Interrupt Enable **/
#define CAN1_IER_SERR		(1 << 25)
/** CAN1_IER_CERR CRC Error Interrupt Enable **/
#define CAN1_IER_CERR		(1 << 24)
/** CAN1_IER_TSTP TimeStamp Interrupt Enable **/
#define CAN1_IER_TSTP		(1 << 23)
/** CAN1_IER_TOVF Timer Overflow Interrupt Enable **/
#define CAN1_IER_TOVF		(1 << 22)
/** CAN1_IER_WAKEUP Wakeup Interrupt Enable **/
#define CAN1_IER_WAKEUP		(1 << 21)
/** CAN1_IER_SLEEP Sleep Interrupt Enable **/
#define CAN1_IER_SLEEP		(1 << 20)
/** CAN1_IER_BOFF Bus Off Mode Interrupt Enable **/
#define CAN1_IER_BOFF		(1 << 19)
/** CAN1_IER_ERRP Error Passive Mode Interrupt Enable **/
#define CAN1_IER_ERRP		(1 << 18)
/** CAN1_IER_WARN Warning Limit Interrupt Enable **/
#define CAN1_IER_WARN		(1 << 17)
/** CAN1_IER_ERRA Error Active Mode Interrupt Enable **/
#define CAN1_IER_ERRA		(1 << 16)
/** CAN1_IER_MB7 Mailbox 7 Interrupt Enable **/
#define CAN1_IER_MB7		(1 << 7)
/** CAN1_IER_MB6 Mailbox 6 Interrupt Enable **/
#define CAN1_IER_MB6		(1 << 6)
/** CAN1_IER_MB5 Mailbox 5 Interrupt Enable **/
#define CAN1_IER_MB5		(1 << 5)
/** CAN1_IER_MB4 Mailbox 4 Interrupt Enable **/
#define CAN1_IER_MB4		(1 << 4)
/** CAN1_IER_MB3 Mailbox 3 Interrupt Enable **/
#define CAN1_IER_MB3		(1 << 3)
/** CAN1_IER_MB2 Mailbox 2 Interrupt Enable **/
#define CAN1_IER_MB2		(1 << 2)
/** CAN1_IER_MB1 Mailbox 1 Interrupt Enable **/
#define CAN1_IER_MB1		(1 << 1)
/** CAN1_IER_MB0 Mailbox 0 Interrupt Enable **/
#define CAN1_IER_MB0		(1 << 0)

/**@}*/

/** @defgroup can1_idr IDR Interrupt Disable Register
@{*/

/** CAN1_IDR_BERR Bit Error Interrupt Disable **/
#define CAN1_IDR_BERR		(1 << 28)
/** CAN1_IDR_FERR Form Error Interrupt Disable **/
#define CAN1_IDR_FERR		(1 << 27)
/** CAN1_IDR_AERR Acknowledgment Error Interrupt Disable **/
#define CAN1_IDR_AERR		(1 << 26)
/** CAN1_IDR_SERR Stuffing Error Interrupt Disable **/
#define CAN1_IDR_SERR		(1 << 25)
/** CAN1_IDR_CERR CRC Error Interrupt Disable **/
#define CAN1_IDR_CERR		(1 << 24)
/** CAN1_IDR_TSTP TimeStamp Interrupt Disable **/
#define CAN1_IDR_TSTP		(1 << 23)
/** CAN1_IDR_TOVF Timer Overflow Interrupt **/
#define CAN1_IDR_TOVF		(1 << 22)
/** CAN1_IDR_WAKEUP Wakeup Interrupt Disable **/
#define CAN1_IDR_WAKEUP		(1 << 21)
/** CAN1_IDR_SLEEP Sleep Interrupt Disable **/
#define CAN1_IDR_SLEEP		(1 << 20)
/** CAN1_IDR_BOFF Bus Off Mode Interrupt Disable **/
#define CAN1_IDR_BOFF		(1 << 19)
/** CAN1_IDR_ERRP Error Passive Mode Interrupt Disable **/
#define CAN1_IDR_ERRP		(1 << 18)
/** CAN1_IDR_WARN Warning Limit Interrupt Disable **/
#define CAN1_IDR_WARN		(1 << 17)
/** CAN1_IDR_ERRA Error Active Mode Interrupt Disable **/
#define CAN1_IDR_ERRA		(1 << 16)
/** CAN1_IDR_MB7 Mailbox 7 Interrupt Disable **/
#define CAN1_IDR_MB7		(1 << 7)
/** CAN1_IDR_MB6 Mailbox 6 Interrupt Disable **/
#define CAN1_IDR_MB6		(1 << 6)
/** CAN1_IDR_MB5 Mailbox 5 Interrupt Disable **/
#define CAN1_IDR_MB5		(1 << 5)
/** CAN1_IDR_MB4 Mailbox 4 Interrupt Disable **/
#define CAN1_IDR_MB4		(1 << 4)
/** CAN1_IDR_MB3 Mailbox 3 Interrupt Disable **/
#define CAN1_IDR_MB3		(1 << 3)
/** CAN1_IDR_MB2 Mailbox 2 Interrupt Disable **/
#define CAN1_IDR_MB2		(1 << 2)
/** CAN1_IDR_MB1 Mailbox 1 Interrupt Disable **/
#define CAN1_IDR_MB1		(1 << 1)
/** CAN1_IDR_MB0 Mailbox 0 Interrupt Disable **/
#define CAN1_IDR_MB0		(1 << 0)

/**@}*/

/** @defgroup can1_imr IMR Interrupt Mask Register
@{*/

/** CAN1_IMR_BERR Bit Error Interrupt Mask **/
#define CAN1_IMR_BERR		(1 << 28)
/** CAN1_IMR_FERR Form Error Interrupt Mask **/
#define CAN1_IMR_FERR		(1 << 27)
/** CAN1_IMR_AERR Acknowledgment Error Interrupt Mask **/
#define CAN1_IMR_AERR		(1 << 26)
/** CAN1_IMR_SERR Stuffing Error Interrupt Mask **/
#define CAN1_IMR_SERR		(1 << 25)
/** CAN1_IMR_CERR CRC Error Interrupt Mask **/
#define CAN1_IMR_CERR		(1 << 24)
/** CAN1_IMR_TSTP Timestamp Interrupt Mask **/
#define CAN1_IMR_TSTP		(1 << 23)
/** CAN1_IMR_TOVF Timer Overflow Interrupt Mask **/
#define CAN1_IMR_TOVF		(1 << 22)
/** CAN1_IMR_WAKEUP Wakeup Interrupt Mask **/
#define CAN1_IMR_WAKEUP		(1 << 21)
/** CAN1_IMR_SLEEP Sleep Interrupt Mask **/
#define CAN1_IMR_SLEEP		(1 << 20)
/** CAN1_IMR_BOFF Bus Off Mode Interrupt Mask **/
#define CAN1_IMR_BOFF		(1 << 19)
/** CAN1_IMR_ERRP Error Passive Mode Interrupt Mask **/
#define CAN1_IMR_ERRP		(1 << 18)
/** CAN1_IMR_WARN Warning Limit Interrupt Mask **/
#define CAN1_IMR_WARN		(1 << 17)
/** CAN1_IMR_ERRA Error Active Mode Interrupt Mask **/
#define CAN1_IMR_ERRA		(1 << 16)
/** CAN1_IMR_MB7 Mailbox 7 Interrupt Mask **/
#define CAN1_IMR_MB7		(1 << 7)
/** CAN1_IMR_MB6 Mailbox 6 Interrupt Mask **/
#define CAN1_IMR_MB6		(1 << 6)
/** CAN1_IMR_MB5 Mailbox 5 Interrupt Mask **/
#define CAN1_IMR_MB5		(1 << 5)
/** CAN1_IMR_MB4 Mailbox 4 Interrupt Mask **/
#define CAN1_IMR_MB4		(1 << 4)
/** CAN1_IMR_MB3 Mailbox 3 Interrupt Mask **/
#define CAN1_IMR_MB3		(1 << 3)
/** CAN1_IMR_MB2 Mailbox 2 Interrupt Mask **/
#define CAN1_IMR_MB2		(1 << 2)
/** CAN1_IMR_MB1 Mailbox 1 Interrupt Mask **/
#define CAN1_IMR_MB1		(1 << 1)
/** CAN1_IMR_MB0 Mailbox 0 Interrupt Mask **/
#define CAN1_IMR_MB0		(1 << 0)

/**@}*/

/** @defgroup can1_sr SR Status Register
@{*/

/** CAN1_SR_OVLSY Overload busy **/
#define CAN1_SR_OVLSY		(1 << 31)
/** CAN1_SR_TBSY Transmitter busy **/
#define CAN1_SR_TBSY		(1 << 30)
/** CAN1_SR_RBSY Receiver busy **/
#define CAN1_SR_RBSY		(1 << 29)
/** CAN1_SR_BERR Bit Error **/
#define CAN1_SR_BERR		(1 << 28)
/** CAN1_SR_FERR Form Error **/
#define CAN1_SR_FERR		(1 << 27)
/** CAN1_SR_AERR Acknowledgment Error **/
#define CAN1_SR_AERR		(1 << 26)
/** CAN1_SR_SERR Mailbox Stuffing Error **/
#define CAN1_SR_SERR		(1 << 25)
/** CAN1_SR_CERR Mailbox CRC Error **/
#define CAN1_SR_CERR		(1 << 24)
/** CAN1_SR_TSTP  **/
#define CAN1_SR_TSTP		(1 << 23)
/** CAN1_SR_TOVF Timer Overflow **/
#define CAN1_SR_TOVF		(1 << 22)
/** CAN1_SR_WAKEUP CAN controller is not in Low power Mode **/
#define CAN1_SR_WAKEUP		(1 << 21)
/** CAN1_SR_SLEEP CAN controller in Low power Mode **/
#define CAN1_SR_SLEEP		(1 << 20)
/** CAN1_SR_BOFF Bus Off Mode **/
#define CAN1_SR_BOFF		(1 << 19)
/** CAN1_SR_ERRP Error Passive Mode **/
#define CAN1_SR_ERRP		(1 << 18)
/** CAN1_SR_WARN Warning Limit **/
#define CAN1_SR_WARN		(1 << 17)
/** CAN1_SR_ERRA Error Active Mode **/
#define CAN1_SR_ERRA		(1 << 16)
/** CAN1_SR_MB7 Mailbox 7 Event **/
#define CAN1_SR_MB7		(1 << 7)
/** CAN1_SR_MB6 Mailbox 6 Event **/
#define CAN1_SR_MB6		(1 << 6)
/** CAN1_SR_MB5 Mailbox 5 Event **/
#define CAN1_SR_MB5		(1 << 5)
/** CAN1_SR_MB4 Mailbox 4 Event **/
#define CAN1_SR_MB4		(1 << 4)
/** CAN1_SR_MB3 Mailbox 3 Event **/
#define CAN1_SR_MB3		(1 << 3)
/** CAN1_SR_MB2 Mailbox 2 Event **/
#define CAN1_SR_MB2		(1 << 2)
/** CAN1_SR_MB1 Mailbox 1 Event **/
#define CAN1_SR_MB1		(1 << 1)
/** CAN1_SR_MB0 Mailbox 0 Event **/
#define CAN1_SR_MB0		(1 << 0)

/**@}*/

/** @defgroup can1_br BR Baudrate Register
@{*/

/** CAN1_BR_SMP Sampling Mode **/
#define CAN1_BR_SMP		(1 << 24)

#define CAN1_BR_BRP_SHIFT		16
#define CAN1_BR_BRP_MASK		0x7f
/** @defgroup can1_br_brp BRP Baudrate Prescaler.
@{*/
/**@}*/


