grevaillot/svd_tools/headers/ATSAM3X8H/can1.h
#define CAN1_BR_SJW_SHIFT		12
#define CAN1_BR_SJW_MASK		0x03
/** @defgroup can1_br_sjw SJW Re-synchronization jump width
@{*/
/**@}*/


#define CAN1_BR_PROPAG_SHIFT		8
#define CAN1_BR_PROPAG_MASK		0x07
/** @defgroup can1_br_propag PROPAG Programming time segment
@{*/
/**@}*/


#define CAN1_BR_PHASE1_SHIFT		4
#define CAN1_BR_PHASE1_MASK		0x07
/** @defgroup can1_br_phase1 PHASE1 Phase 1 segment
@{*/
/**@}*/


#define CAN1_BR_PHASE2_SHIFT		0
#define CAN1_BR_PHASE2_MASK		0x07
/** @defgroup can1_br_phase2 PHASE2 Phase 2 segment
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_tim TIM Timer Register
@{*/


#define CAN1_TIM_TIMER_SHIFT		0
#define CAN1_TIM_TIMER_MASK		0xffff
/** @defgroup can1_tim_timer TIMER Timer
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_timestp TIMESTP Timestamp Register
@{*/


#define CAN1_TIMESTP_MTIMESTAMP_SHIFT		0
#define CAN1_TIMESTP_MTIMESTAMP_MASK		0xffff
/** @defgroup can1_timestp_mtimestamp MTIMESTAMP Timestamp
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_ecr ECR Error Counter Register
@{*/


#define CAN1_ECR_TEC_SHIFT		16
#define CAN1_ECR_TEC_MASK		0xff
/** @defgroup can1_ecr_tec TEC Transmit Error Counter
@{*/
/**@}*/


#define CAN1_ECR_REC_SHIFT		0
#define CAN1_ECR_REC_MASK		0xff
/** @defgroup can1_ecr_rec REC Receive Error Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_tcr TCR Transfer Command Register
@{*/

/** CAN1_TCR_TIMRST Timer Reset **/
#define CAN1_TCR_TIMRST		(1 << 31)
/** CAN1_TCR_MB7 Transfer Request for Mailbox 7 **/
#define CAN1_TCR_MB7		(1 << 7)
/** CAN1_TCR_MB6 Transfer Request for Mailbox 6 **/
#define CAN1_TCR_MB6		(1 << 6)
/** CAN1_TCR_MB5 Transfer Request for Mailbox 5 **/
#define CAN1_TCR_MB5		(1 << 5)
/** CAN1_TCR_MB4 Transfer Request for Mailbox 4 **/
#define CAN1_TCR_MB4		(1 << 4)
/** CAN1_TCR_MB3 Transfer Request for Mailbox 3 **/
#define CAN1_TCR_MB3		(1 << 3)
/** CAN1_TCR_MB2 Transfer Request for Mailbox 2 **/
#define CAN1_TCR_MB2		(1 << 2)
/** CAN1_TCR_MB1 Transfer Request for Mailbox 1 **/
#define CAN1_TCR_MB1		(1 << 1)
/** CAN1_TCR_MB0 Transfer Request for Mailbox 0 **/
#define CAN1_TCR_MB0		(1 << 0)

/**@}*/

/** @defgroup can1_acr ACR Abort Command Register
@{*/

/** CAN1_ACR_MB7 Abort Request for Mailbox 7 **/
#define CAN1_ACR_MB7		(1 << 7)
/** CAN1_ACR_MB6 Abort Request for Mailbox 6 **/
#define CAN1_ACR_MB6		(1 << 6)
/** CAN1_ACR_MB5 Abort Request for Mailbox 5 **/
#define CAN1_ACR_MB5		(1 << 5)
/** CAN1_ACR_MB4 Abort Request for Mailbox 4 **/
#define CAN1_ACR_MB4		(1 << 4)
/** CAN1_ACR_MB3 Abort Request for Mailbox 3 **/
#define CAN1_ACR_MB3		(1 << 3)
/** CAN1_ACR_MB2 Abort Request for Mailbox 2 **/
#define CAN1_ACR_MB2		(1 << 2)
/** CAN1_ACR_MB1 Abort Request for Mailbox 1 **/
#define CAN1_ACR_MB1		(1 << 1)
/** CAN1_ACR_MB0 Abort Request for Mailbox 0 **/
#define CAN1_ACR_MB0		(1 << 0)

/**@}*/

/** @defgroup can1_wpmr WPMR Write Protect Mode Register
@{*/


#define CAN1_WPMR_WPKEY_SHIFT		8
#define CAN1_WPMR_WPKEY_MASK		0xffffff
/** @defgroup can1_wpmr_wpkey WPKEY SPI Write Protection Key Password
@{*/
/**@}*/

/** CAN1_WPMR_WPEN Write Protection Enable **/
#define CAN1_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup can1_wpsr WPSR Write Protect Status Register
@{*/


#define CAN1_WPSR_WPVSRC_SHIFT		8
#define CAN1_WPSR_WPVSRC_MASK		0xff
/** @defgroup can1_wpsr_wpvsrc WPVSRC Write Protection Violation Source
@{*/
/**@}*/

/** CAN1_WPSR_WPVS Write Protection Violation Status **/
#define CAN1_WPSR_WPVS		(1 << 0)

/**@}*/

/** @defgroup can1_mmr0 MMR0 Mailbox Mode Register (MB = 0)
@{*/


#define CAN1_MMR0_MOT_SHIFT		24
#define CAN1_MMR0_MOT_MASK		0x07
/** @defgroup can1_mmr0_mot MOT Mailbox Object Type
@{*/
/**@}*/


#define CAN1_MMR0_PRIOR_SHIFT		16
#define CAN1_MMR0_PRIOR_MASK		0x0f
/** @defgroup can1_mmr0_prior PRIOR Mailbox Priority
@{*/
/**@}*/


#define CAN1_MMR0_MTIMEMARK_SHIFT		0
#define CAN1_MMR0_MTIMEMARK_MASK		0xffff
/** @defgroup can1_mmr0_mtimemark MTIMEMARK Mailbox Timemark
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mam0 MAM0 Mailbox Acceptance Mask Register (MB = 0)
@{*/

/** CAN1_MAM0_MIDE Identifier Version **/
#define CAN1_MAM0_MIDE		(1 << 29)

#define CAN1_MAM0_MIDvA_SHIFT		18
#define CAN1_MAM0_MIDvA_MASK		0x7ff
/** @defgroup can1_mam0_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN1_MAM0_MIDvB_SHIFT		0
#define CAN1_MAM0_MIDvB_MASK		0x3ffff
/** @defgroup can1_mam0_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mid0 MID0 Mailbox ID Register (MB = 0)
@{*/

/** CAN1_MID0_MIDE Identifier Version **/
#define CAN1_MID0_MIDE		(1 << 29)

#define CAN1_MID0_MIDvA_SHIFT		18
#define CAN1_MID0_MIDvA_MASK		0x7ff
/** @defgroup can1_mid0_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN1_MID0_MIDvB_SHIFT		0
#define CAN1_MID0_MIDvB_MASK		0x3ffff
/** @defgroup can1_mid0_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mfid0 MFID0 Mailbox Family ID Register (MB = 0)
@{*/


#define CAN1_MFID0_MFID_SHIFT		0
#define CAN1_MFID0_MFID_MASK		0x1fffffff
/** @defgroup can1_mfid0_mfid MFID Family ID
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_msr0 MSR0 Mailbox Status Register (MB = 0)
@{*/

/** CAN1_MSR0_MMI Mailbox Message Ignored **/
#define CAN1_MSR0_MMI		(1 << 24)
/** CAN1_MSR0_MRDY Mailbox Ready **/
#define CAN1_MSR0_MRDY		(1 << 23)
/** CAN1_MSR0_MABT Mailbox Message Abort **/
#define CAN1_MSR0_MABT		(1 << 22)
/** CAN1_MSR0_MRTR Mailbox Remote Transmission Request **/
#define CAN1_MSR0_MRTR		(1 << 20)

#define CAN1_MSR0_MDLC_SHIFT		16
#define CAN1_MSR0_MDLC_MASK		0x0f
/** @defgroup can1_msr0_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


#define CAN1_MSR0_MTIMESTAMP_SHIFT		0
#define CAN1_MSR0_MTIMESTAMP_MASK		0xffff
/** @defgroup can1_msr0_mtimestamp MTIMESTAMP Timer value
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mdl0 MDL0 Mailbox Data Low Register (MB = 0)
@{*/


#define CAN1_MDL0_MDL_SHIFT		0
#define CAN1_MDL0_MDL_MASK		0xffffffff
/** @defgroup can1_mdl0_mdl MDL Message Data Low Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mdh0 MDH0 Mailbox Data High Register (MB = 0)
@{*/


