grevaillot/svd_tools/headers/ATSAM3X8H/can1.h
/** @defgroup can1_mdl2 MDL2 Mailbox Data Low Register (MB = 2)
@{*/


#define CAN1_MDL2_MDL_SHIFT		0
#define CAN1_MDL2_MDL_MASK		0xffffffff
/** @defgroup can1_mdl2_mdl MDL Message Data Low Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mdh2 MDH2 Mailbox Data High Register (MB = 2)
@{*/


#define CAN1_MDH2_MDH_SHIFT		0
#define CAN1_MDH2_MDH_MASK		0xffffffff
/** @defgroup can1_mdh2_mdh MDH Message Data High Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mcr2 MCR2 Mailbox Control Register (MB = 2)
@{*/

/** CAN1_MCR2_MTCR Mailbox Transfer Command **/
#define CAN1_MCR2_MTCR		(1 << 23)
/** CAN1_MCR2_MACR Abort Request for Mailbox x **/
#define CAN1_MCR2_MACR		(1 << 22)
/** CAN1_MCR2_MRTR Mailbox Remote Transmission Request **/
#define CAN1_MCR2_MRTR		(1 << 20)

#define CAN1_MCR2_MDLC_SHIFT		16
#define CAN1_MCR2_MDLC_MASK		0x0f
/** @defgroup can1_mcr2_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mmr3 MMR3 Mailbox Mode Register (MB = 3)
@{*/


#define CAN1_MMR3_MOT_SHIFT		24
#define CAN1_MMR3_MOT_MASK		0x07
/** @defgroup can1_mmr3_mot MOT Mailbox Object Type
@{*/
/**@}*/


#define CAN1_MMR3_PRIOR_SHIFT		16
#define CAN1_MMR3_PRIOR_MASK		0x0f
/** @defgroup can1_mmr3_prior PRIOR Mailbox Priority
@{*/
/**@}*/


#define CAN1_MMR3_MTIMEMARK_SHIFT		0
#define CAN1_MMR3_MTIMEMARK_MASK		0xffff
/** @defgroup can1_mmr3_mtimemark MTIMEMARK Mailbox Timemark
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mam3 MAM3 Mailbox Acceptance Mask Register (MB = 3)
@{*/

/** CAN1_MAM3_MIDE Identifier Version **/
#define CAN1_MAM3_MIDE		(1 << 29)

#define CAN1_MAM3_MIDvA_SHIFT		18
#define CAN1_MAM3_MIDvA_MASK		0x7ff
/** @defgroup can1_mam3_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN1_MAM3_MIDvB_SHIFT		0
#define CAN1_MAM3_MIDvB_MASK		0x3ffff
/** @defgroup can1_mam3_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mid3 MID3 Mailbox ID Register (MB = 3)
@{*/

/** CAN1_MID3_MIDE Identifier Version **/
#define CAN1_MID3_MIDE		(1 << 29)

#define CAN1_MID3_MIDvA_SHIFT		18
#define CAN1_MID3_MIDvA_MASK		0x7ff
/** @defgroup can1_mid3_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN1_MID3_MIDvB_SHIFT		0
#define CAN1_MID3_MIDvB_MASK		0x3ffff
/** @defgroup can1_mid3_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mfid3 MFID3 Mailbox Family ID Register (MB = 3)
@{*/


#define CAN1_MFID3_MFID_SHIFT		0
#define CAN1_MFID3_MFID_MASK		0x1fffffff
/** @defgroup can1_mfid3_mfid MFID Family ID
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_msr3 MSR3 Mailbox Status Register (MB = 3)
@{*/

/** CAN1_MSR3_MMI Mailbox Message Ignored **/
#define CAN1_MSR3_MMI		(1 << 24)
/** CAN1_MSR3_MRDY Mailbox Ready **/
#define CAN1_MSR3_MRDY		(1 << 23)
/** CAN1_MSR3_MABT Mailbox Message Abort **/
#define CAN1_MSR3_MABT		(1 << 22)
/** CAN1_MSR3_MRTR Mailbox Remote Transmission Request **/
#define CAN1_MSR3_MRTR		(1 << 20)

#define CAN1_MSR3_MDLC_SHIFT		16
#define CAN1_MSR3_MDLC_MASK		0x0f
/** @defgroup can1_msr3_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


#define CAN1_MSR3_MTIMESTAMP_SHIFT		0
#define CAN1_MSR3_MTIMESTAMP_MASK		0xffff
/** @defgroup can1_msr3_mtimestamp MTIMESTAMP Timer value
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mdl3 MDL3 Mailbox Data Low Register (MB = 3)
@{*/


#define CAN1_MDL3_MDL_SHIFT		0
#define CAN1_MDL3_MDL_MASK		0xffffffff
/** @defgroup can1_mdl3_mdl MDL Message Data Low Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mdh3 MDH3 Mailbox Data High Register (MB = 3)
@{*/


#define CAN1_MDH3_MDH_SHIFT		0
#define CAN1_MDH3_MDH_MASK		0xffffffff
/** @defgroup can1_mdh3_mdh MDH Message Data High Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mcr3 MCR3 Mailbox Control Register (MB = 3)
@{*/

/** CAN1_MCR3_MTCR Mailbox Transfer Command **/
#define CAN1_MCR3_MTCR		(1 << 23)
/** CAN1_MCR3_MACR Abort Request for Mailbox x **/
#define CAN1_MCR3_MACR		(1 << 22)
/** CAN1_MCR3_MRTR Mailbox Remote Transmission Request **/
#define CAN1_MCR3_MRTR		(1 << 20)

#define CAN1_MCR3_MDLC_SHIFT		16
#define CAN1_MCR3_MDLC_MASK		0x0f
/** @defgroup can1_mcr3_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mmr4 MMR4 Mailbox Mode Register (MB = 4)
@{*/


#define CAN1_MMR4_MOT_SHIFT		24
#define CAN1_MMR4_MOT_MASK		0x07
/** @defgroup can1_mmr4_mot MOT Mailbox Object Type
@{*/
/**@}*/


#define CAN1_MMR4_PRIOR_SHIFT		16
#define CAN1_MMR4_PRIOR_MASK		0x0f
/** @defgroup can1_mmr4_prior PRIOR Mailbox Priority
@{*/
/**@}*/


#define CAN1_MMR4_MTIMEMARK_SHIFT		0
#define CAN1_MMR4_MTIMEMARK_MASK		0xffff
/** @defgroup can1_mmr4_mtimemark MTIMEMARK Mailbox Timemark
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mam4 MAM4 Mailbox Acceptance Mask Register (MB = 4)
@{*/

/** CAN1_MAM4_MIDE Identifier Version **/
#define CAN1_MAM4_MIDE		(1 << 29)

#define CAN1_MAM4_MIDvA_SHIFT		18
#define CAN1_MAM4_MIDvA_MASK		0x7ff
/** @defgroup can1_mam4_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN1_MAM4_MIDvB_SHIFT		0
#define CAN1_MAM4_MIDvB_MASK		0x3ffff
/** @defgroup can1_mam4_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mid4 MID4 Mailbox ID Register (MB = 4)
@{*/

/** CAN1_MID4_MIDE Identifier Version **/
#define CAN1_MID4_MIDE		(1 << 29)

#define CAN1_MID4_MIDvA_SHIFT		18
#define CAN1_MID4_MIDvA_MASK		0x7ff
/** @defgroup can1_mid4_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN1_MID4_MIDvB_SHIFT		0
#define CAN1_MID4_MIDvB_MASK		0x3ffff
/** @defgroup can1_mid4_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mfid4 MFID4 Mailbox Family ID Register (MB = 4)
@{*/


#define CAN1_MFID4_MFID_SHIFT		0
#define CAN1_MFID4_MFID_MASK		0x1fffffff
/** @defgroup can1_mfid4_mfid MFID Family ID
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_msr4 MSR4 Mailbox Status Register (MB = 4)
@{*/

