grevaillot/svd_tools/headers/ATSAM3X8H/can1.h
/** CAN1_MSR4_MMI Mailbox Message Ignored **/
#define CAN1_MSR4_MMI		(1 << 24)
/** CAN1_MSR4_MRDY Mailbox Ready **/
#define CAN1_MSR4_MRDY		(1 << 23)
/** CAN1_MSR4_MABT Mailbox Message Abort **/
#define CAN1_MSR4_MABT		(1 << 22)
/** CAN1_MSR4_MRTR Mailbox Remote Transmission Request **/
#define CAN1_MSR4_MRTR		(1 << 20)

#define CAN1_MSR4_MDLC_SHIFT		16
#define CAN1_MSR4_MDLC_MASK		0x0f
/** @defgroup can1_msr4_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


#define CAN1_MSR4_MTIMESTAMP_SHIFT		0
#define CAN1_MSR4_MTIMESTAMP_MASK		0xffff
/** @defgroup can1_msr4_mtimestamp MTIMESTAMP Timer value
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mdl4 MDL4 Mailbox Data Low Register (MB = 4)
@{*/


#define CAN1_MDL4_MDL_SHIFT		0
#define CAN1_MDL4_MDL_MASK		0xffffffff
/** @defgroup can1_mdl4_mdl MDL Message Data Low Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mdh4 MDH4 Mailbox Data High Register (MB = 4)
@{*/


#define CAN1_MDH4_MDH_SHIFT		0
#define CAN1_MDH4_MDH_MASK		0xffffffff
/** @defgroup can1_mdh4_mdh MDH Message Data High Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mcr4 MCR4 Mailbox Control Register (MB = 4)
@{*/

/** CAN1_MCR4_MTCR Mailbox Transfer Command **/
#define CAN1_MCR4_MTCR		(1 << 23)
/** CAN1_MCR4_MACR Abort Request for Mailbox x **/
#define CAN1_MCR4_MACR		(1 << 22)
/** CAN1_MCR4_MRTR Mailbox Remote Transmission Request **/
#define CAN1_MCR4_MRTR		(1 << 20)

#define CAN1_MCR4_MDLC_SHIFT		16
#define CAN1_MCR4_MDLC_MASK		0x0f
/** @defgroup can1_mcr4_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mmr5 MMR5 Mailbox Mode Register (MB = 5)
@{*/


#define CAN1_MMR5_MOT_SHIFT		24
#define CAN1_MMR5_MOT_MASK		0x07
/** @defgroup can1_mmr5_mot MOT Mailbox Object Type
@{*/
/**@}*/


#define CAN1_MMR5_PRIOR_SHIFT		16
#define CAN1_MMR5_PRIOR_MASK		0x0f
/** @defgroup can1_mmr5_prior PRIOR Mailbox Priority
@{*/
/**@}*/


#define CAN1_MMR5_MTIMEMARK_SHIFT		0
#define CAN1_MMR5_MTIMEMARK_MASK		0xffff
/** @defgroup can1_mmr5_mtimemark MTIMEMARK Mailbox Timemark
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mam5 MAM5 Mailbox Acceptance Mask Register (MB = 5)
@{*/

/** CAN1_MAM5_MIDE Identifier Version **/
#define CAN1_MAM5_MIDE		(1 << 29)

#define CAN1_MAM5_MIDvA_SHIFT		18
#define CAN1_MAM5_MIDvA_MASK		0x7ff
/** @defgroup can1_mam5_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN1_MAM5_MIDvB_SHIFT		0
#define CAN1_MAM5_MIDvB_MASK		0x3ffff
/** @defgroup can1_mam5_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mid5 MID5 Mailbox ID Register (MB = 5)
@{*/

/** CAN1_MID5_MIDE Identifier Version **/
#define CAN1_MID5_MIDE		(1 << 29)

#define CAN1_MID5_MIDvA_SHIFT		18
#define CAN1_MID5_MIDvA_MASK		0x7ff
/** @defgroup can1_mid5_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN1_MID5_MIDvB_SHIFT		0
#define CAN1_MID5_MIDvB_MASK		0x3ffff
/** @defgroup can1_mid5_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mfid5 MFID5 Mailbox Family ID Register (MB = 5)
@{*/


#define CAN1_MFID5_MFID_SHIFT		0
#define CAN1_MFID5_MFID_MASK		0x1fffffff
/** @defgroup can1_mfid5_mfid MFID Family ID
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_msr5 MSR5 Mailbox Status Register (MB = 5)
@{*/

/** CAN1_MSR5_MMI Mailbox Message Ignored **/
#define CAN1_MSR5_MMI		(1 << 24)
/** CAN1_MSR5_MRDY Mailbox Ready **/
#define CAN1_MSR5_MRDY		(1 << 23)
/** CAN1_MSR5_MABT Mailbox Message Abort **/
#define CAN1_MSR5_MABT		(1 << 22)
/** CAN1_MSR5_MRTR Mailbox Remote Transmission Request **/
#define CAN1_MSR5_MRTR		(1 << 20)

#define CAN1_MSR5_MDLC_SHIFT		16
#define CAN1_MSR5_MDLC_MASK		0x0f
/** @defgroup can1_msr5_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


#define CAN1_MSR5_MTIMESTAMP_SHIFT		0
#define CAN1_MSR5_MTIMESTAMP_MASK		0xffff
/** @defgroup can1_msr5_mtimestamp MTIMESTAMP Timer value
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mdl5 MDL5 Mailbox Data Low Register (MB = 5)
@{*/


#define CAN1_MDL5_MDL_SHIFT		0
#define CAN1_MDL5_MDL_MASK		0xffffffff
/** @defgroup can1_mdl5_mdl MDL Message Data Low Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mdh5 MDH5 Mailbox Data High Register (MB = 5)
@{*/


#define CAN1_MDH5_MDH_SHIFT		0
#define CAN1_MDH5_MDH_MASK		0xffffffff
/** @defgroup can1_mdh5_mdh MDH Message Data High Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mcr5 MCR5 Mailbox Control Register (MB = 5)
@{*/

/** CAN1_MCR5_MTCR Mailbox Transfer Command **/
#define CAN1_MCR5_MTCR		(1 << 23)
/** CAN1_MCR5_MACR Abort Request for Mailbox x **/
#define CAN1_MCR5_MACR		(1 << 22)
/** CAN1_MCR5_MRTR Mailbox Remote Transmission Request **/
#define CAN1_MCR5_MRTR		(1 << 20)

#define CAN1_MCR5_MDLC_SHIFT		16
#define CAN1_MCR5_MDLC_MASK		0x0f
/** @defgroup can1_mcr5_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mmr6 MMR6 Mailbox Mode Register (MB = 6)
@{*/


#define CAN1_MMR6_MOT_SHIFT		24
#define CAN1_MMR6_MOT_MASK		0x07
/** @defgroup can1_mmr6_mot MOT Mailbox Object Type
@{*/
/**@}*/


#define CAN1_MMR6_PRIOR_SHIFT		16
#define CAN1_MMR6_PRIOR_MASK		0x0f
/** @defgroup can1_mmr6_prior PRIOR Mailbox Priority
@{*/
/**@}*/


#define CAN1_MMR6_MTIMEMARK_SHIFT		0
#define CAN1_MMR6_MTIMEMARK_MASK		0xffff
/** @defgroup can1_mmr6_mtimemark MTIMEMARK Mailbox Timemark
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mam6 MAM6 Mailbox Acceptance Mask Register (MB = 6)
@{*/

/** CAN1_MAM6_MIDE Identifier Version **/
#define CAN1_MAM6_MIDE		(1 << 29)

#define CAN1_MAM6_MIDvA_SHIFT		18
#define CAN1_MAM6_MIDvA_MASK		0x7ff
/** @defgroup can1_mam6_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN1_MAM6_MIDvB_SHIFT		0
#define CAN1_MAM6_MIDvB_MASK		0x3ffff
/** @defgroup can1_mam6_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mid6 MID6 Mailbox ID Register (MB = 6)
@{*/

/** CAN1_MID6_MIDE Identifier Version **/
#define CAN1_MID6_MIDE		(1 << 29)

#define CAN1_MID6_MIDvA_SHIFT		18
#define CAN1_MID6_MIDvA_MASK		0x7ff
/** @defgroup can1_mid6_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN1_MID6_MIDvB_SHIFT		0
#define CAN1_MID6_MIDvB_MASK		0x3ffff
/** @defgroup can1_mid6_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_mfid6 MFID6 Mailbox Family ID Register (MB = 6)
@{*/


